In [64]:
import pandas as pd
import numpy as np

d = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7, 8]], columns=['co1', 'co2', 'co3', 'co4'])
d

   co1  co2  co3  co4
0    1    2    3    4
1    5    6    7    8

In [65]:
dd = pd.DataFrame({'co1': [1, 5], 'co2': [2, 6], 'co3': [3, 7], 'co4': [4, 8]})
dd

   co1  co2  co3  co4
0    1    2    3    4
1    5    6    7    8

In [66]:
dd.values

array([[1, 2, 3, 4],
       [5, 6, 7, 8]], dtype=int64)

In [67]:
dd.index = list(range(1, 3))
dd

   co1  co2  co3  co4
1    1    2    3    4
2    5    6    7    8

In [68]:
dd['co2']

1    2
2    6
Name: co2, dtype: int64

In [69]:
dd[['co2', 'co3']]

   co2  co3
1    2    3
2    6    7

In [70]:
dd.co1

1    1
2    5
Name: co1, dtype: int64

In [71]:
dd.iloc[0]
dd.iloc[0:1]

   co1  co2  co3  co4
1    1    2    3    4

In [72]:
dd['co5'] = [10, 11]
dd

   co1  co2  co3  co4  co5
1    1    2    3    4   10
2    5    6    7    8   11

In [73]:
del dd['co2']
dd

   co1  co3  co4  co5
1    1    3    4   10
2    5    7    8   11

In [77]:
dd.apply(lambda x : x + 2)

   co1  co3  co4  co5
1    3    5    6   12
2    7    9   10   13

In [79]:
dd.apply(sum)

co1     6
co3    10
co4    12
co5    21
dtype: int64

In [81]:
dd.apply(sum, axis=1)

1    18
2    31
dtype: int64

In [89]:
dd.apply(lambda x : x[1] + x[2])

co1     6
co3    10
co4    12
co5    21
dtype: int64

In [95]:
dd.apply(lambda x : x[0] + x[1] + x[2] + x[3], axis=1)

1    18
2    31
dtype: int64